<h4>从每篇文章抓取</h4>
<p>从每篇文章里最大抓取远程图片的量，不知道为什么会有人有这种需求……</p>
<h4>最小图像尺寸</h4>
<p>忽略比这个尺寸更小的图像。还可以选择自动删除小于最小图像尺寸的图片。</p>
<h4>最大图像尺寸</h4>
<p>自动缩小大于该尺寸的图像。如果你想要宽度不超过800px和任意高度图片，请设置宽度800，并设置高度为空。<br />以及不抓取文件大小超过指定MB的图像。</p>
<h4>排除域名/关键词</h4>
<p>如果图片地址包含所设置的排除域名/关键词，则不会保存该图片。</p>
<h4>排除 CRC</h4>
<p>如果远程图像的CRC在此列表中，则不会被保存。</p>
<h4>删除 CRC</h4>
<p>如果远程图像的CRC在此列表中，其HTML代码会被删除。它的优先级高于排除CRC。</p>
<h4>已排除的关键词</h4>
<p>目前程序里已排除的域名关键词</p>
<h2>小窍门</h2>
<h4>如何获取文件的CRC值？</h4>
<p>循环冗余校验（英语：Cyclic redundancy check，通称“CRC”）是一种根据网络数据包或计算机文件等数据产生简短固定位数校验码的一种散列函数，主要用来检测或校验数据传输或者保存后可能出现的错误。生成的数字在传输或者存储之前计算出来并且附加到数据后面，然后接收方进行检验确定数据是否发生变化。一般来说，循环冗余校验的值都是32位的整数。由于本函数易于用二进制的计算机硬件使用、容易进行数学分析并且尤其善于检测传输通道干扰引起的错误，因此获得广泛应用。</p>
<p>可以通过7-Zip或WinRAR等压缩软件轻松获取到：</p>
<p align="center"><img src="<?php print QQWORLD_COLLECTOR_URL; ?>images/auto-save-attachments/get-crc.png" /></p>