<p>自动保存远程图片到本地，自动设置特色图片，并且支持机器人采集软件从外部提交。</p>
<h2>常规设置</h2>
<h4>文件类型</h4>
<p>3.0支持抓取音视频和PDF了。</p>
<h4>模式</h4>
<dl>
	<dt>在保存或发布文章时，自动将所有远程图像保存到本地媒体库。</dt>
	<dd>如果要使用类似火车头遮掩的采集软件从外部提交，就需要设置为这个自动模式。</dd>
	<dt>当单击编辑器顶部的按钮时，手动将所有远程图像保存到本地媒体库。</dt>
	<dd>推荐使用手动模式，因为可以使用多线程采集，只要你的服务器性能够强，可以同时抓取全部附件。<br />默认只会同时抓取2个，如果想抓取更多，请在 <a href="<?php print admin_url('admin.php?page=qqworld-collector-settings#server'); ?>" target="_blank">服务器压力</a> 中设置 <strong>速度</strong>。</dd>
</dl>
<h4>什么时候</h4>
<p>一般选择已发布即可，因为文章总是会发布的对吧。</p>
<h4>定时发布</h4>
<p>通过定时发布保存远程图像。</p>
<h4>远程发布</h4>
<p>保存通过IFTTT或其他使用XMLRPC方法远程发布的远程图片。仅支持发布文章。</p>
<h4>设置特色图片</h4>
<p>启用后自动设置特色图片。</p>
<h4>默认特色图片</h4>
<p>如果文章中没有图片，设置一个默认特色图像。留空则不使用默认图。<br />并不推荐使用这个，最好是在主题的模板中进行判断。</p>
<h4>水平翻转图像</h4>
<p>自动水平翻转图像，就像镜像一样。可以起到一定的伪原创效果，你懂的，最好祈祷图片里没有文字。</p>
<h4>不使用媒体库</h4>
<p>远程图像不会被保存到媒体库，这意味着不会生成各种尺寸的缩略图。<br />
但如果你勾选了设置特色图片，则只会将指定的特色图片保存到媒体库。</p>
<p>在3.0里，不使用媒体库也可以防止重复采集了，因为建了一个本地缓存文件来记录已经抓取到本地的附件。</p>