<h2>参数设置</h2>
<h4>选择文章类型</h4>
<p>这个是必选的，否则无法进行。</p>
<h4>分类目录</h4>
<p>选择文章类型后就会自动显示这些文章类型旗下有哪些分类目录了，默认留空扫描所有分类。</p>
<h4>文章ID范围</h4>
<p>默认留空扫描所有文章ID，如果要扫描50-100的文章ID，请输入'50'和'100'或者'100'和'50'，两个数字的顺序可以颠倒。如果你只输入了1个数字，则系统只会扫描该ID。</p>
<h4>偏移</h4>
<p>默认扫秒全部文章，如果想扫描50-150篇文章，请在文本框中输入“50”并在下拉菜单中选择“100”。</p>
<h4>状态</h4>
<p>扫描指定文章状态的文章。</p>
<h4>排序依据</h4>
<p>决定扫描的文章顺序。</p>
<h4>排序</h4>
<p>是倒序还是正序呢？</p>
<h4>速度</h4>
<p>如果服务器压力过大，可以适当调低速度。</p>
<h4>强制扫描</h4>
<p>成功被扫描的文章将被标记，不会被再次扫描。如果勾选此项，它们将被再次扫描。</p>
<h2>扫描模式</h2>
<h4>自动</h4>
<p>扫描所有的文章，将所有远程图片保存到本地，可能需要很长时间。</p>
<h4>手动</h4>
<p>显示的列表中将告诉你哪些文章包含远程图片，然后你可以通过点击“抓取”按钮手动保存。</p>
<h4>计划任务</h4>
<p>设置计划任务自动扫描文章。<br />建议设置偏移从0开始扫描100篇文章。</p>
<h2>小窍门</h2>
<h4>如何增加计划任务时间间隔？</h4>
<p>注意，这个不会新建计划任务，只是增加一些时间间隔。<br />将下面的代码放到主题的functions.php文件中。</p>
<pre class="prism"><code class="language-php">function bing_add_schedules($schedules) {
	$schedules['2hours'] = array(
		'interval' => 7200,
		'display' => "每两小时"
	);
	return $schedules;
}
add_filter( 'cron_schedules', 'bing_add_schedules' );</code></pre>