<dl>
	<dt>200</dt><dd>成功。</dd>
	<dt>304</dt><dd>未修改。<br />客户端请求的文档已在其缓存中，文档自缓存以来尚未被修改过。客户端使用文档的缓存副本，而不从服务器下载文档。</dd>
	<dt>401.1</dt><dd>登录失败。<br />登录尝试不成功，可能因为用户名或密码无效。</dd>
	<dt>403</dt><dd>禁止访问。</dd>
	<dt>403.1</dt><dd>执行访问被禁止。</dd>
	<dt>403.2</dt><dd>读访问被禁止。</dd>
	<dt>403.3</dt><dd>写访问被禁止。</dd>
	<dt>403.4</dt><dd>要求 SSL。</dd>
	<dt>403.5</dt><dd>要求 SSL 128</dd>
	<dt>403.6</dt><dd>IP 地址被拒绝。您已把您的服务器配置为拒绝访问您目前的 IP 地址。</dd>
	<dt>403.7</dt><dd>要求客户端证书。</dd>
	<dt>403.8</dt><dd>站点访问被拒绝。</dd>
	<dt>403.9</dt><dd>用户数过多。与该服务器连接的用户数量超过了您设置的连接限制。</dd>
	<dt>403.12</dt><dd>拒绝访问映射表。<br />您要访问的页面要求提供客户端证书，但映射到您的客户端证书的用户 ID 已被拒绝访问该文件。</dd>
	<dt>404</dt><dd>未找到。<br />发生此错误的原因是您试图访问的文件已被移走或删除。</dd>
	<dt>500</dt><dd>内部服务器错误。<br />很多服务器端的错误都可能导致该错误信息。事件查看器日志包含更详细的错误原因。</dd>
	<dt>502</dt><dd>网关错误。</dd>
	<dt>503</dt><dd>服务不可用。</dd>
	<dt>504</dt><dd>网关超时。</dd>
	<dt>505</dt><dd>HTTP 版本不受支持。</dd>
</dl>