<p align="center"><img src="<?php print QQWORLD_COLLECTOR_URL; ?>images/banner-772x250.jpg" /></p>
<h2>前世今生</h2>
<h4>QQWorld自动保存图片 / QQWorld Auto Save Images</h4>
<p>这是一款用户上万的抓图免费插件，最开始是工作之余为学习PHP而练手开发的，反响很不错，越来越多的人使用该插件并且给予好评，我也乐得其中，但随着用户量的不断增大，新的需求也在不断提出，于是我就开始着手开发其付费的专业版。</p>
<h4>QQWorld自动保存图片专业版 / QQWorld Auto Save Images Pro</h4>
<p>自从开始开发专业版，免费版就不在做升级服务了，所有新的功能都将在专业版上开发。与此同时，我也在计划开发一款名叫<strong><a href="https://www.qqworld.org/product/qqworld-collector" target="_blank">QQWorld收藏家</a></strong>的采集插件，后来干脆将QQWorld自动保存图片专业版的功能并入QQWorld收藏家进行统一开发，于是QQWorld收藏家第一版诞生了，起初其实就是QQWorld自动保存图片专业版。</p>
<h4>QQWorld收藏家 v1.0 / QQWorld Collector v1.0</h4>
<p>之所以叫收藏家，因为初衷是希望用户能够对采集到的图片和文章进行精挑细选，起到收藏的目的。</p>
<p>这一款插件的售价是39元，很便宜吧，甚至还引来了某德国人的嘲笑。使用激活码离线激活方式。这个插件在我自制的网店系统（属于QQWorld框架3.0上的一个模块）上销售。</p>
<p>当时的涨价标准是每卖出10个涨价1元，随着开发工作的不断进展，越来越多功能被加入，比如定时扫描、云存储等，并且在用户的怂恿下，加速开发出了采集功能，也就是所谓的收藏项目。有了采集功能，价格迎来了第一次暴涨，考虑到并不是所有人都需要全部的功能，所以将插件分成了三个档次，分别是专业版69元，云存储129元，采集199元，最初购买专业版的用户全部免费升级到旗舰版。</p>
<h4>QQWorld收藏家（经典版）v2.0  / QQWorld Collector (Classic) v2.0</h4>
<p>随着越来越多的用户抱怨无法修改域名，也不方便补差价升级。于是在2017年1月19日，QQWorld收藏家2.0发布，取消了激活码，使用在线激活的方式，完美地解决了这个问题，并且也将销售系统从自制系统转到了Woocommerce。</p>
<p>并且随着功能的不断完善和升级，其售价也提升到专业版99元，服务器版169元和采集299元。</p>
<h4>运营自媒体的想法</h4>
<p>2018年初，为了进一步提高销量，我考虑开自媒体进行宣传，除了教大家使用和Wordpress有关的一些知识外，会着重介绍QQWorld收藏家和QQWorld主题制造插件，会做大量的视频教程。</p>
<p>问题来了，虽然很多用户反映目前来说QQWorld收藏家是最好用的一款采集插件，但是我心里明白，这款插件不够专业，采集某些网站会非常费劲，而且扩展性不好，于是我就萌生了将QQWorld收藏家进行完全重制的想法。所以这个自媒体是现在就开呢，还是在QQWorld收藏家3.0开发完成之后再开。考虑到2.0和3.0的采集方法会有翻天覆地的变化，不通用，所以我选择了后者。于是本来计划在一年内完成的QQWorld收藏家3.0重制计划被提前到数月完成。</p>
<h4>QQWorld收藏家（豪华版）v3.0 / QQWorld Collector (Deluxe) v3.0</h4>
<p>不负众望，QQWorld收藏家3.0终于在2018年8月放出了第1个版本，将所有的程序都重写了，解决了不少遗留问题，新增数个免费的云存储，而收藏项目的重制成果也远远超过了设计，新版采集引擎拥有非常灵活的特性，可以在不使用魔法采集的情况下轻松采集过去需要魔法采集才能采集的网站，并且拥有极强的扩展能力（开发过滤器非常方便）。</p>
<p>其售价也调整为专业版129元，服务器版199元，旗舰版399元，还根据功能分出两个新版本，分别是云存储版99元和站长版299元。</p>
<h4>至于QQWorld收藏家4.0嘛，叫重制版吗？或者挂DLC？开发，还是不开发，这是个问题……</h4>