<p>将不显示的图片地址放到地址栏里访问：</p>
<h1>不能显示</h1>
<p>可能的原因有：</p>
<dl>
	<dt>404 文件未找到</dt>
	<dd>如果是本地地址说明本地图片文件丢失，如果是云存储的地址，在媒体库列表模式下找到该附件重新同步一下即可，如果本地图已经删掉了，就没办法了。</dd>
</dl>
<h1>可以显示</h1>
<p>可能的原因有：</p>
<dl>
	<dt>防盗链</dt>
	<dd>检查云存储后台设置是否有防盗链功能阻止了图片的显示，如果是图床地址，可能该图床已经不能用了，请换一个。</dd>
	<dt>开启了云缩略图</dt>
	<dd>检查插件云存储设置是否开启了云缩略图，尝试去掉云缩略图的尾巴看图片是否可以显示，如果确定是云缩略图的问题，请咨询云存储相关的客服。</dd>
	<dt>SSL安全问题</dt>
	<dd>你的网站是HTTPS安全协议的，而云存储地址是HTTP的，所以无法显示不安全的地址，解决方法：请将你的网站协议改成HTTP，或将云存储地址的协议改成HTTPS，并且确保云存储的域名支持SSL。</dd>
</dl>