<h2>采集网站</h2>
<p>建议用 <strong>手动采集</strong> 采集已发布的文章，从后面开始采集，比如一个列表有20页，先采集11-20页，再采集1-10页。<br />采集完历史文章之后用 <strong>定时采集</strong> 采集第一页即可，会自动采集每天更新的新文章。</p>
<h2>保存远程附件</h2>
<p>每个收藏项目都可以在采集设置中更换文章状态，默认是待审状态。默认规则是不抓图的，在采集设置里开启保存远程附件，会覆盖全局的自动保存附件开关。</p>
<h2>翻译</h2>
<p>必须给每一个采集项目增加翻译过滤器才会执行翻译程序，通常只需要给文章标题，文章内容和文章摘要加上过滤器即可。</p>
<p>注意，如果在列表页采集到了标题，就不会在内容页采集标题了，所以通常要将翻译过滤器加在列表页采集的文章标题上。</p>
<h2>伪原创</h2>
<p>每个收藏项目的采集设置中都有伪原创的开关。</p>
<h2>乱码</h2>
<p>如果采集到的内容有乱码，检查网页的编码，填写到收藏项目规则的采集设置中去，就算网页的编码的确是UTF-8，也要填到规则里设置，通常都可以解决乱码问题。</p>
<h2>选择器</h2>
<p>不管有没有父选择器，请一律简化方法值，如果不够精确才需要加父选择器，如下图所示：</p>
<p align="center"><img src="<?php print QQWORLD_COLLECTOR_DOCUMENTS_URL; ?>collector/collecting-manual/by-css-selector/1.png" /></p>
<p>可以只填 <em>h4</em>，如果不够精确，才需要改成 <em>div.post h4</em>。</p>