<p>主要用于本地局域网版向远程服务器推送采集到的内容，可以有效降低服务器 <strong>60%-80%</strong> 的压力。</p>
<h1>注意事项</h1>
<ol>
	<li>所有的附件必须入库，不兼容 <strong>不使用媒体库</strong> 功能。</li>
	<li>如果你的文章内容有分页，不要使用类似 <?php print home_url('/archive/14751.html'); ?> 的固定链接。</li>
	<li>如果你使用Windows服务器，所有网站的固定链接中都不要出现中文字符。</li>
</ol>
<h1>设置详解</h1>
<p>点击添加远程站点按钮，会新建一个表单。</p>
<h2>标题</h2>
<p>用于在收藏项目的采集设置中快速识别远程网站。</p>
<h2>类型</h2>
<p>包括常规远程推送WordPress，以及高级远程推送（仅旗舰版支持）。</p>
<h3>一、WordPress</h3>
<dl>
	<dt>网站首页地址</dt>
	<dd>注意：只能推送到序列号所 <a href="https://www.qqworld.org/account/product-activation" target="_blank">绑定域名</a> 的 <strong>可采集版本</strong> 的网站。</dd>
	<dt>登录名</dt>
	<dd>请填写具有管理员角色的用户名。</dd>
	<dt>密码</dt>
	<dd>和用户名匹配。</dd>
	<dt>模式</dt>
	<dd><dl>
		<dt>常规模式</dt>
		<dd>将采集到的内容原封不动地投送到远程站点，远程站点抓取远程图片。<br /><em>如果你的服务器性能够强悍，可以使用这种模式，本地不需要抓图，采集速度最快。</em></dd>
		<dt>高级模式</dt>
		<dd>本地抓取远程图，直接投送给远程站点，降低服务器采集压力。<br /><em>本地必须抓图，可以有效降低服务器的压力，不论是否开启云存储，都会将采集到的图片备份到远程站点。</em></dd>
		<dt>另类模式</dt>
		<dd>本地抓取远程图片并保存到云存储，不投送图片到远程站点，仅旗舰版支持。<br /><em>本地必须抓图，但必须开启云存储。</em></dd>
	</dl></dd>
	<dt>检测重复</dt>
	<dd>投送之前检查远程站点是否有相同标题的文章，如果有则覆盖。<br /><span class="qc-icon info">注意，只适应于老网站，且可能非常耗费时间。</span><br /><em>如果使用一段时间后，基本上不会采集到重复文章了，可以考虑关闭该功能。</em></dd>
</dl>
<h3>二、高级远程发布</h3>
<ol>
	<li>文件传输协议（FTP）</li>
	<li>七牛云存储（QINIU）</li>
	<li>阿里云开放存储服务（OSS）</li>
	<li>腾讯对象存储服务（COS）</li>
	<li>华为云对象存储服务（OBS）</li>
	<li>又拍云存储（UPYUN）</li>
	<li>百度对象存储（BOS）</li>
</ol>
<p>请先通过云存储设置中的 <strong>同步网站资源</strong> 功能，将网站的图片、脚本、字体等内容同步到云存储上。<br />
<span class="qc-icon info">除 <strong>文件传输协议（FTP）</strong>外，其他云存储都需要在后台设置里开启 <strong>静态文件托管</strong>，并且将索引文件设置为 <strong>index.html</strong>。</span></p>