<h2>服务器压力</h2>
<h4>速度</h4>
<p>用于手动模式，如果你的服务器不够强大，可以尝试将速度调低。<br />
如果将数值设置为2，相当于只能同时采集2个远程附件或文章。</p>
<h4>抓取时间间隔</h4>
<p>如果采集速度过快，有些网站会屏蔽你的服务器IP。</p>
<h4>超时</h4>
<p>PHP运行时间限制 (默认值: 30秒)，<br />
<strong>手动模式：</strong>大多数情况默认30秒足矣，但如果你想下载微信图片，建议设置为3分钟。<br />
<strong>自动模式：</strong>如果要一次抓取很多远程图像，就需要设置更长的时间。建议设置为半小时。<br />
<strong>扫描模式：</strong>建议设置10倍于自动模式所需的时间。</p>
<h2>HTTP文件头</h2>
<p>下面的设置将帮助你更好地抓取远程图像。</p>
<h4>文件头 - 用户代理（User-Agent）</h4>
<p>抓取某些远程图片需要设置文件头的用户代理，有些不需要。</p>
<h4>文件头 - 参照地址（HTTP-Referer）</h4>
<p>极少数远程图片需要设置HTTP参照地址。</p>
<h4>文件头 - Cookies</h4>
<p>有些网站或远程附件需要填写Cookies才能采集。</p>